final List<Map<String, dynamic>> employeeMonthlyReports = [
  {
    "الموظف": {
      "الاسم": "أحمد يوسف",
      "الرقم": "388253",
      "القسم": "قسم الترخيص",
      "الوظيفة": "موظف معاملات",
      "تاريخ التعيين": "2021-08-15",
      "الترتيب": {
        "على مستوى القسم": 1,
        "على مستوى الدائرة": 3
      }
    },
    "الأداء": {
      "عدد المعاملات": 48,
      "منجزة": 38,
      "مرفوضة": 4,
      "قيد الإنجاز": 3,
      "متأخرة": 3
    },
    "تفاصيل الإنجاز": {
      "أعلى زمن إنجاز": 65,
      "أقل زمن": 12,
      "متوسط": 27,
      "تم إنجازها ضمن الوقت المحدد": 35,
      "آخر معاملة": {
        "رقم": "TRX-8291",
        "نوع": "تجديد رخصة",
        "تاريخ": "2025-05-30",
        "المدة": 29,
        "الحالة": "تم الإنجاز"
      }
    },
    "توزيع المعاملات": {
      "تجديد رخصة مركبة": 15,
      "نقل ملكية": 10,
      "تجديد رخصة قيادة": 8,
      "إلغاء مركبة": 4,
      "تعديل بيانات": 5,
      "تحويل مركبة": 6
    },
    "الشكاوى": {
      "الواردة": 3,
      "تمت معالجتها": 3,
      "زمن الرد": 4.5,
      "تفصيل": {
        "مخالفة بيانات": 1,
        "تأخير": 1,
        "سوء معاملة": 1
      }
    },
    "مقارنة الشهر الماضي": {
      "عدد المعاملات": 42,
      "فرق": "+16",
      "نسبة التحسن": "+27.5%"
    }
  },

  {
    "الموظف": {
      "الاسم": "منى خالد",
      "الرقم": "441122",
      "القسم": "قسم خدمات الجمهور",
      "الوظيفة": "موظفة استقبال",
      "تاريخ التعيين": "2020-06-10",
      "الترتيب": {
        "على مستوى القسم": 2,
        "على مستوى الدائرة": 6
      }
    },
    "الأداء": {
      "عدد المعاملات": 52,
      "منجزة": 44,
      "مرفوضة": 3,
      "قيد الإنجاز": 2,
      "متأخرة": 3
    },
    "تفاصيل الإنجاز": {
      "أعلى زمن إنجاز": 70,
      "أقل زمن": 10,
      "متوسط": 25,
      "تم إنجازها ضمن الوقت المحدد": 40,
      "آخر معاملة": {
        "رقم": "TRX-9312",
        "نوع": "تعديل بيانات",
        "تاريخ": "2025-05-28",
        "المدة": 32,
        "الحالة": "تم الإنجاز"
      }
    },
    "توزيع المعاملات": {
      "تجديد رخصة قيادة": 18,
      "نقل ملكية": 7,
      "تعديل بيانات": 12,
      "تحويل مركبة": 6,
      "إلغاء مركبة": 9
    },
    "الشكاوى": {
      "الواردة": 2,
      "تمت معالجتها": 2,
      "زمن الرد": 3.0,
      "تفصيل": {
        "مخالفة بيانات": 0,
        "تأخير": 1,
        "سوء معاملة": 1
      }
    },
    "مقارنة الشهر الماضي": {
      "عدد المعاملات": 49,
      "فرق": "+3",
      "نسبة التحسن": "+6.1%"
    }
  },

  {
    "الموظف": {
      "الاسم": "زياد عمر",
      "الرقم": "772299",
      "القسم": "قسم تكنولوجيا المعلومات",
      "الوظيفة": "فني صيانة أنظمة",
      "تاريخ التعيين": "2019-09-25",
      "الترتيب": {
        "على مستوى القسم": 1,
        "على مستوى الدائرة": 2
      }
    },
    "الأداء": {
      "عدد المعاملات": 35,
      "منجزة": 30,
      "مرفوضة": 1,
      "قيد الإنجاز": 2,
      "متأخرة": 2
    },
    "تفاصيل الإنجاز": {
      "أعلى زمن إنجاز": 55,
      "أقل زمن": 15,
      "متوسط": 22,
      "تم إنجازها ضمن الوقت المحدد": 28,
      "آخر معاملة": {
        "رقم": "TRX-7456",
        "نوع": "فحص نظام",
        "تاريخ": "2025-05-27",
        "المدة": 21,
        "الحالة": "تم الإنجاز"
      }
    },
    "توزيع المعاملات": {
      "صيانة أنظمة": 20,
      "دعم فني": 10,
      "تركيب أجهزة": 5
    },
    "الشكاوى": {
      "الواردة": 1,
      "تمت معالجتها": 1,
      "زمن الرد": 2.5,
      "تفصيل": {
        "مخالفة بيانات": 0,
        "تأخير": 0,
        "سوء معاملة": 1
      }
    },
    "مقارنة الشهر الماضي": {
      "عدد المعاملات": 33,
      "فرق": "+2",
      "نسبة التحسن": "+6.0%"
    }
  },
];
