final List<Map<String, dynamic>> previousSuggestions = [
  {
    'title': 'تفعيل التنبيهات الفورية عند تسجيل مخالفة جديدة',
    'category': 'تحسين التطبيق',
    'rating': 5,
    'date': '2025-05-09',
  },
  {
    'title': 'إضافة خاصية تجديد الرخصة إلكترونيًا بالكامل',
    'category': 'توفير خدمات جديدة',
    'rating': 4,
    'date': '2025-05-07',
  },
  {
    'title': 'تحسين واجهة المستخدم في صفحة المركبات',
    'category': 'تجربة المستخدم',
    'rating': 3,
    'date': '2025-05-05',
  },
  {
    'title': 'إمكانية متابعة حالة الطلب بعد تقديمه',
    'category': 'تطوير الخدمات',
    'rating': 5,
    'date': '2025-05-03',
  },
  {
    'title': 'إضافة شات بوت للإجابة على الاستفسارات الشائعة',
    'category': 'تحسين الدعم الفني',
    'rating': 4,
    'date': '2025-05-01',
  },
];
