final Map<String, List<String>> appointmentLocations = {
  'رام الله': [
    'فرع رام الله الرئيسي',
    'فرع البيرة',
    'فرع بيتونيا',
    'فرع سلواد'
  ],
  'نابلس': [
    'فرع نابلس الرئيسي',
    'فرع عصيرة الشمالية',
    'فرع بيت إيبا',
    'فرع زواتا'
  ],
  'الخليل': [
    'فرع الخليل الرئيسي',
    'فرع دورا',
    'فرع الظاهرية',
    'فرع يطا'
  ],
  'بيت لحم': [
    'فرع بيت لحم الرئيسي',
    'فرع بيت جالا',
    'فرع الدوحة',
    'فرع الخضر'
  ],
  'جنين': [
    'فرع جنين الرئيسي',
    'فرع قباطية',
    'فرع اليامون',
    'فرع الزبابدة'
  ],
  'طولكرم': [
    'فرع طولكرم الرئيسي',
    'فرع عنبتا',
    'فرع بلعا',
    'فرع شويكة'
  ],
  'قلقيلية': [
    'فرع قلقيلية الرئيسي',
    'فرع عزون',
    'فرع حبلة',
    'فرع كفر ثلث'
  ],
  'أريحا': [
    'فرع أريحا الرئيسي',
    'فرع العوجا',
    'فرع مرج نعجة',
    'فرع النويعمة'
  ],
  'طوباس': [
    'فرع طوباس الرئيسي',
    'فرع العقبة',
    'فرع تياسير',
    'فرع عين البيضا'
  ],
  'سلفيت': [
    'فرع سلفيت الرئيسي',
    'فرع بديا',
    'فرع كفل حارس',
    'فرع دير استيا'
  ],
};
